Repository: weblabdeusto/weblablib-example-complete
Catalog: mylab/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Programming: %(step)s
es: Programando: %(step)s

source: Empty memory
es: Memoria vacía

source: Programming failed
es: Programación fallida

source: Programming worked!
es: El programa ha funcionado!

source: Invalid state: %(state)s
es: Estado inválido: %(state)s

source: My lab
es: Mi laboratorio

source: Welcome to <strong>mylab</strong>!
es: ¡Bienvenidos a <strong>mylab</strong>!

source: Your session is expired
es: Tu sesión ha caducado

source: However, given that in <tt>views.py</tt> the view <tt>index</tt> is using <tt>@requires_login</tt> instead of <tt>@requires_active</tt>, the user can still access the lab
es: Sin embargo, dado que en <tt>views.py</tt> la vista <tt>index</tt> usa <tt>@requires_login</tt> en lugar de <tt>@requires_active</tt>, el usuario puede todavía acceder al laboratorio

source: Go back
es: Volver

source: Log out
es: Salir

source: This is just an example laboratory using <a href='%(link)s'>weblablib</a>. Imagine that we have 10 lights and a microcontroller with some code that interacts with them. Here we can turn on and off the lights and send programs to the microcontroller.
es: Este es sólo un ejemplo de laboratorio usando <a href='%(link)s'>weblablib</a>. Imagina que tenemos 10 luces y un microcontrolador con algo de código que interacciona con las luces. Aquí podemos encender y apagar las luces y mandar programas al microcontrolador.

source: Time:
es: Tiempo:

source: Lights: click on each light to change status (and read it in the console)
es: Luces: haz click en cada luz para cambiar su estado (y lee en la consola)

source: Light %(number)s
es: Luz %(number)s

source: Microcontroller status:
es: Estado del microcontrolador:

source: Send good program
es: Enviar programa bueno

source: Send bad program
es: Enviar programa malo

source: Time is over!
es: ¡Se ha acabado el tiempo!

source: 1 second
es: 1 segundo

source: NUM seconds
es: NUM segundos
